# 8. Select Data (iloc)
Select data (from specified row and column) by location

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('score.xlsx', index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1     채치수  북산고  197   90   85  100  95  85      Python
2     정대만  북산고  184   40   35   50  55  25        Java
3     송태섭  북산고  168   80   75   70  80  75  Javascript
4     서태웅  북산고  187   40   60   70  75  80         NaN
5     강백호  북산고  188   15   20   10  35  10         NaN
6     변덕규  능남고  202   80  100   95  85  80           C
7     황태산  능남고  188   55   65   45  40  35      PYTHON
8     윤대협  능남고  190  100   85   90  95  95          C#

In [4]:
df.iloc[0] # grab the first row

이름         채치수
학교         북산고
키          197
국어          90
영어          85
수학         100
과학          95
사회          85
SW특기    Python
Name: 1, dtype: object

In [5]:
df.iloc[4]

이름      강백호
학교      북산고
키       188
국어       15
영어       20
수학       10
과학       35
사회       10
SW특기    NaN
Name: 5, dtype: object

In [6]:
df.iloc[0:5]

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1     채치수  북산고  197  90  85  100  95  85      Python
2     정대만  북산고  184  40  35   50  55  25        Java
3     송태섭  북산고  168  80  75   70  80  75  Javascript
4     서태웅  북산고  187  40  60   70  75  80         NaN
5     강백호  북산고  188  15  20   10  35  10         NaN

In [7]:
df.iloc[0, 1] # first row, second column

'북산고'

In [8]:
df.iloc[4, 2]

188

In [9]:
df.iloc[[0, 1], 2] # third column for the first two rows

지원번호
1    197
2    184
Name: 키, dtype: int64

In [11]:
df.iloc[[0, 1, 2, 3, 4], [3, 4, 5]]

      국어  영어   수학
지원번호
1     90  85  100
2     40  35   50
3     80  75   70
4     40  60   70
5     15  20   10

In [12]:
df.iloc[0:5, 3:8]

      국어  영어   수학  과학  사회
지원번호
1     90  85  100  95  85
2     40  35   50  55  25
3     80  75   70  80  75
4     40  60   70  75  80
5     15  20   10  35  10